{"modelTopology": {"training_config": {"metrics": [], "loss": {"seen_before": "binary_crossentropy", "char_4": "categorical_crossentropy", "char_3": "categorical_crossentropy", "char_2": "categorical_crossentropy", "char_1": "categorical_crossentropy", "char_0": "categorical_crossentropy"}, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "sample_weight_mode": null, "loss_weights": {"seen_before": 2, "char_4": 0.4096000000000001, "char_3": 0.5120000000000001, "char_2": 0.6400000000000001, "char_1": 0.8, "char_0": 1.0}}, "keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 30], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 300], "name": "hist", "sparse": false}, "name": "hist"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]], [["hist", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_1", "dtype": "float32", "output_dim": 64, "trainable": true, "embeddings_regularizer": null, "input_dim": 52, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, null], "activity_regularizer": null, "input_length": null}, "name": "embedding_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "shared_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "shared_conv1"}, {"class_name": "Conv1D", "inbound_nodes": [[["shared_conv1", 0, 0, {}]], [["shared_conv1", 1, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "shared_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [2], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "shared_conv2"}, {"class_name": "Conv1D", "inbound_nodes": [[["shared_conv2", 0, 0, {}]], [["shared_conv2", 1, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "shared_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "shared_conv3"}, {"class_name": "Dropout", "inbound_nodes": [[["shared_conv3", 0, 0, {}]]], "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Dropout", "inbound_nodes": [[["shared_conv3", 1, 0, {}]]], "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_2"}, {"class_name": "Add", "inbound_nodes": [[["shared_conv1", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "shortcut_char"}, "name": "shortcut_char"}, {"class_name": "Add", "inbound_nodes": [[["shared_conv1", 1, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "shortcut_hist"}, "name": "shortcut_hist"}, {"class_name": "Conv1D", "inbound_nodes": [[["shortcut_char", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_char4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv_char4"}, {"class_name": "Conv1D", "inbound_nodes": [[["shortcut_hist", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv_hist4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [4], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv_hist4"}, {"class_name": "Dropout", "inbound_nodes": [[["conv_char4", 0, 0, {}]]], "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "name": "dropout_3"}, {"class_name": "Dropout", "inbound_nodes": [[["conv_hist4", 0, 0, {}]]], "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}, "name": "dropout_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": -1}, "name": "batch_normalization_4"}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_2"}, "name": "global_max_pooling1d_2"}, {"class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_1"}, "name": "global_max_pooling1d_1"}, {"class_name": "Dense", "inbound_nodes": [[["global_max_pooling1d_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "name": "dense_1"}, {"class_name": "Dense", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "name": "dense_2"}, {"class_name": "Add", "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]], "config": {"trainable": true, "name": "added"}, "name": "added"}, {"class_name": "Dense", "inbound_nodes": [[["added", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "char_0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 52, "use_bias": true, "activity_regularizer": null}, "name": "char_0"}, {"class_name": "Dense", "inbound_nodes": [[["added", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "char_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 52, "use_bias": true, "activity_regularizer": null}, "name": "char_1"}, {"class_name": "Dense", "inbound_nodes": [[["added", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "char_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 52, "use_bias": true, "activity_regularizer": null}, "name": "char_2"}, {"class_name": "Dense", "inbound_nodes": [[["added", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "char_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 52, "use_bias": true, "activity_regularizer": null}, "name": "char_3"}, {"class_name": "Dense", "inbound_nodes": [[["added", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "char_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 52, "use_bias": true, "activity_regularizer": null}, "name": "char_4"}, {"class_name": "Dense", "inbound_nodes": [[["added", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "seen_before", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "name": "seen_before"}], "input_layers": [["input_1", 0, 0], ["hist", 0, 0]], "name": "model_1", "output_layers": [["char_0", 0, 0], ["char_1", 0, 0], ["char_2", 0, 0], ["char_3", 0, 0], ["char_4", 0, 0], ["seen_before", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_3/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "batch_normalization_4/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 52], "name": "char_0/kernel"}, {"dtype": "float32", "shape": [52], "name": "char_0/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 52], "name": "char_1/kernel"}, {"dtype": "float32", "shape": [52], "name": "char_1/bias"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 52], "name": "char_2/kernel"}, {"dtype": "float32", "shape": [52], "name": "char_2/bias"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 52], "name": "char_3/kernel"}, {"dtype": "float32", "shape": [52], "name": "char_3/bias"}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 52], "name": "char_4/kernel"}, {"dtype": "float32", "shape": [52], "name": "char_4/bias"}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 64, 64], "name": "conv_char4/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_char4/bias"}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 64, 64], "name": "conv_hist4/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv_hist4/bias"}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 64], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_1/bias"}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 64], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_2/bias"}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "shape": [52, 64], "name": "embedding_1/embeddings"}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 1], "name": "seen_before/kernel"}, {"dtype": "float32", "shape": [1], "name": "seen_before/bias"}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 64, 64], "name": "shared_conv1/kernel"}, {"dtype": "float32", "shape": [64], "name": "shared_conv1/bias"}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 64, 64], "name": "shared_conv2/kernel"}, {"dtype": "float32", "shape": [64], "name": "shared_conv2/bias"}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 64, 64], "name": "shared_conv3/kernel"}, {"dtype": "float32", "shape": [64], "name": "shared_conv3/bias"}]}]}